{"byWeapon":[
        {"weapon": "Unarmed", "deeds": "Blinding Attack, Defensive Fighting, Disarming Attacks, Grappling Holds/Chokes, Headbutt, Howling Fury/Rage, Rallying Maneuvers, Kick, Punch, Pushbacks, Scare/Intimidate, Trips & Throws"},
        {"weapon": "Battleaxe", "deeds": "Bleeding Strike, Blinding Attack, Death From Above, Decapitating Strike, Defensive Fighting, Defensive Maneuvers, Disable Creature’s Wing, Disarming Attacks, Headbutt, Howling Fury/Rage, Kick, Muting Strike, Pushbacks, Rallying Maneuvers, Rend Armor, Scare/Intimidate, Sever Arm, Sever Leg, Stand Your Ground, Subdual Weapon Knockout, Throw Weapon, Trips & Throws, Whirlwind Attack"},
        {"weapon": "Club", "deeds": "Bind & Strike, Blinding Attack, Cripple Arm, Cripple Leg, Death From Above, Defensive Fighting, Defensive Maneuvers, Disable Creature’s Wing, Disarming Attacks, Headbutt, Howling Fury/Rage, Kick, Muting Strike, Punch, Pushbacks, Rallying Maneuvers, Scare/ Intimidate, Stand Your Ground, Subdual Weapon Knockout, Throw Weapon, Trips & Throws"},
        {"weapon": "Crossbow", "deeds": "Bleeding Strike, Blinding Attack, Defensive Maneuvers, Disable Creature’s Wing, Disarming Attacks, Muting Strike, Paralyze Arm, Paralyze Leg, Pierce Internal Organs, Pin Opponent, Precision Shot, Rallying Maneuvers, Scare/Intimidate, Stand Your Ground, Trips & Throws"},
        {"weapon": "Dagger", "deeds": "Bind & Strike, Bleeding Strike, Blinding Attack, Defensive Fighting, Defensive Maneuvers, Disable Creature’s Wing, Disarming Attacks, Headbutt, Howling Fury/Rage, Kick, Muting Strike, Paralyze Arm, Paralyze Leg, Pierce Internal Organs, Pin Opponent, Punch, Pushbacks, Precision Shot, Rallying Maneuvers, Scare/Intimidate, Stand Your Ground, Trips & Throws"},
        {"weapon": "Dart", "deeds": "Bleeding Strike, Blinding Attack, Defensive Maneuvers, Disable Creature’s Wing, Disarming Attacks, Muting Strike, Paralyze Arm, Paralyze Leg, Pierce Internal Organs, Pin Opponent, Precision Shot, Rallying Maneuvers, Scare/Intimidate, Trips & Throws"},
        {"weapon": "Flail", "deeds": "Blinding Attack, Cripple Arm, Cripple Leg, Death From Above, Defensive Fighting, Defensive Maneuvers, Disable Creature’s Wing, Disarming Attacks, Headbutt, Howling Fury/ Rage, Kick, Muting Strike, Punch, Pushbacks, Rallying Maneuvers, Scare/Intimidate, Stand Your Ground, Throw Weapon, Trips & Throws"},
        {"weapon": "Handaxe", "deeds": "Bind & Strike, Bleeding Strike, Blinding Attack, Death From Above, Decapitating Strike , Defensive Fighting, Defensive Maneuvers, Disable Creature’s Wing, Disarming Attacks, Headbutt, Howling Fury/Rage, Kick, Muting Strike, Pin Opponent, Punch, Pushbacks, Precision Shot, Rallying Maneuvers, Scare/Intimidate, Sever Arm, Sever Leg, Stand Your Ground, Subdual Weapon Knockout, Trips & Throws"},
        {"weapon": "Lance", "deeds": "Bleeding Strike, Blinding Attack, Death From Above, Defensive Fighting, Defensive Maneuvers, Disable Creature’s Wing, Disarming Attacks, Howling Fury/Rage, Jousting Attack, Muting Strike, Paralyze Arm, Paralyze Leg, Pierce Internal Organs, Pin Opponent, Pushbacks, Rallying Maneuvers, Rend Armor, Scare/Intimidate, Sever Arm, Sever Leg, Shield Bash, Trips & Throws"},
        {"weapon": "Bow", "deeds": "Bleeding Strike, Blinding Attack, Defensive Maneuvers, Disable Creature’s Wing, Disarming Attacks, Muting Strike, Paralyze Arm, Paralyze Leg, Pierce Internal Organs, Pin Opponent, Precision Shot, Rallying Maneuvers, Scare/Intimidate, Stand Your Ground, Trips & Throws"},
        {"weapon": "Sword", "deeds": "Bind & Strike, Bleeding Strike, Blinding Attack, Death From Above, Decapitating Strike, Defensive Fighting, Defensive Maneuvers, Disable Creature’s Wing, Disarming Attacks, Headbutt, Howling Fury/Rage, Kick, Muting Strike, Paralyze Arm, Paralyze Leg, Pierce Internal Organs, Punch, Pushbacks, Rallying Maneuvers, Scare/Intimidate, Sever Arm, Sever Leg, Stand Your Ground, Subdual Weapon Knockout, Throw Weapon, Trips & Throws"},
        {"weapon": "Mace", "deeds": "Bind & Strike, Blinding Attack, Cripple Arm, Cripple Leg, Death From Above, Defensive Fighting, Defensive Maneuvers, Disable Creature’s Wing, Disarming Attacks, Headbutt, Howling Fury/Rage, Kick, Muting Strike, Punch, Pushbacks, Rallying Maneuvers, Scare/Intimidate, Stand Your Ground, Subdual Weapon Knockout, Throw Weapon, Trips & Throws"},
        {"weapon": "Polearm", "deeds": "Bleeding Strike, Blinding Attack, Decapitating Strike, Defensive Fighting, Defensive Maneuvers, Disable Creature’s Wing, Disarming Attacks, Headbutt, Howling Fury/Rage, Kick, Muting Strike, Paralyze Arm, Paralyze Leg, Pierce Internal Organs, Punch, Pushbacks, Rallying Maneuvers, Rend Armor, Scare/Intimidate, Sever Arm, Sever Leg, Stand Your Ground, Throw Weapon, Trips & Throws, Whirlwind Attack"},
        {"weapon": "Shield", "deeds": "Blinding Attack, Defensive Fighting, Defensive Maneuvers, Disarming Attacks, Headbutt, Howling Fury/Rage, Kick, Muting Strike, Pushbacks, Rallying Maneuvers, Scare/Intimidate, Shield Bash, Subdual Weapon Knockout, Throw Shield, Trips & Throws"},
        {"weapon": "Sling", "deeds": "Blinding Attack, Cripple Arm, Cripple Leg, Defensive Maneuvers, Disable Creature’s Wing, Disarming Attacks, Muting Strike, Precision Shot, Rallying Maneuvers, Scare/Intimidate, Stand Your Ground, Subdual Weapon Knockout, Trips & Throws"},
        {"weapon": "Spear", "deeds": "Bleeding Strike, Blinding Attack, Death From Above, Defensive Fighting, Defensive Maneuvers, Disable Creature’s Wing, Disarming Attacks, Headbutt, Howling Fury/Rage, Jousting Attack, Kick, Muting Strike, Paralyze Arm, Paralyze Leg, Pierce Internal Organs, Pin Opponent, Pushbacks, Precision Shot, Rallying Maneuvers, Scare/Intimidate, Stand Your Ground, Trips & Throws, Whirlwind Attack"},
        {"weapon": "Staff", "deeds": "Blinding Attack, Bone Crusher, Cripple Arm, Cripple Leg, Defensive Fighting, Defensive Maneuvers, Disable Creature’s Wing, Disarming Attacks, Flurry of Blows, Headbutt, Howling Fury/Rage, Kick, Muting Strike, Pulverize Internal Organs, Pushbacks, Rallying Maneuvers, Rend Armor, Scare/Intimidate, Stand Your Ground, Subdual Weapon Knockout, Throw Weapon, Trips & Throws, Whirlwind Attack"},
        {"weapon": "Two-Handed Sword", "deeds": "Bleeding Strike, Blinding Attack, Death From Above, Decapitating Strike, Defensive Fighting, Defensive Maneuvers, Disable Creature’s Wing, Disarming Attacks, Headbutt, Howling Fury/Rage, Kick, Muting Strike, Paralyze Arm, Paralyze Leg, Pierce Internal Organs, Pushbacks, Rallying Maneuvers, Rend Armor, Scare/Intimidate, Sever Arm, Sever Leg, Stand Your Ground, Subdual Weapon Knockout, Throw Weapon, Trips & Throws, Whirlwind Attack"},
        {"weapon": "War Hammer", "deeds": "Blinding Attack, Bone Crusher, Cripple Arm, Cripple Leg, Death From Above, Defensive Fighting, Defensive Maneuvers, Disable Creature’s Wing, Disarming Attacks, Headbutt, Howling Fury/Rage, Kick, Muting Strike, Pulverize Internal Organs, Pushbacks, Rallying Maneuvers, Rend Armor, Scare/Intimidate, Stand Your Ground, Subdual Weapon Knockout, Throw Weapon,Trips & Throws, Whirlwind Attack"}
        ],   
        "Tables":[
            {"name":"Blinding Attack", "description":"Blinding attacks usually involve making a called shot to an enemy’s eyes. Examples include throwing sand in an enemy’s face, stabbing a knife through a visor, or impaling a target’s eyeball with an arrow. Blinding attacks obviously must take place where appropriate to the enemy; they are useless against oozes, for example. Against certain opponents, such as a cyclops, the judge may 'bump up' results to the next-higher level, given the more serious effect of blinding blows against such creatures.",
                "rolls": {"Mighty Fumble" : "You stumble in your attempt and go crashing to the ground. During the fall you somehow manage to strike yourself. Take normal damage plus roll a crit on yourself using your crit die and table. You are considered prone and must use an action to stand. Melee attacks against a prone character receive a +2 bonus.",
                    "3" : "Opponent’s eyes are irritated and stinging, and he has difficulty seeing. On his next attack, the opponent suffers a -2 attack penalty.",
                    "4" :"Opponent is temporarily blinded. He suffers a -4 penalty to his next attack roll and may only move at half speed.",
                    "5" :"Opponent is completely blinded for 1d4 rounds. He flails about with wild attacks, suffering a -8 penalty to attack rolls, and can move only in a random direction at half speed.",
                    "6" :"Opponent is completely blinded, as above, for 2d6 rounds.",
                    "7" : "Opponent is blinded for the next 24 hours. Additionally, he must make a Fort save against the warrior’s attack roll. On a failure, he is permanently blinded.",
                    "Mighty Critical" : "You completely destroy your opponent’s eyes with a grisly attack. Foe is permanently blinded and falls to the ground paralyzed with shock."}}, 
            {"name":"Throw Shield", "description": "As an act of desperation or an attempt to surprise your foe, you hurl your shield at your opponent. The attack may result in the shield being sundered."}
        ]
}