{"byWeapon":[
        {"weapon": "Unarmed", "deeds": "Blinding Attack, Defensive Fighting, Disarming Attacks, Grappling Holds/Chokes, Headbutt, Howling Fury/Rage, Rallying Maneuvers, Kick, Punch, Pushbacks, Scare/Intimidate, Trips & Throws"},
        {"weapon": "Battleaxe", "deeds": "Bleeding Strike, Blinding Attack, Death From Above, Decapitating Strike, Defensive Fighting, Defensive Maneuvers, Disable Creature’s Wing, Disarming Attacks, Headbutt, Howling Fury/Rage, Kick, Muting Strike, Pushbacks, Rallying Maneuvers, Rend Armor, Scare/Intimidate, Sever Arm, Sever Leg, Stand Your Ground, Subdual Weapon Knockout, Throw Weapon, Trips & Throws, Whirlwind Attack"},
        {"weapon": "Club", "deeds": "Bind & Strike, Blinding Attack, Cripple Arm, Cripple Leg, Death From Above, Defensive Fighting, Defensive Maneuvers, Disable Creature’s Wing, Disarming Attacks, Headbutt, Howling Fury/Rage, Kick, Muting Strike, Punch, Pushbacks, Rallying Maneuvers, Scare/ Intimidate, Stand Your Ground, Subdual Weapon Knockout, Throw Weapon, Trips & Throws"},
        {"weapon": "Crossbow", "deeds": "Bleeding Strike, Blinding Attack, Defensive Maneuvers, Disable Creature’s Wing, Disarming Attacks, Muting Strike, Paralyze Arm, Paralyze Leg, Pierce Internal Organs, Pin Opponent, Precision Shot, Rallying Maneuvers, Scare/Intimidate, Stand Your Ground, Trips & Throws"},
        {"weapon": "Dagger", "deeds": "Bind & Strike, Bleeding Strike, Blinding Attack, Defensive Fighting, Defensive Maneuvers, Disable Creature’s Wing, Disarming Attacks, Headbutt, Howling Fury/Rage, Kick, Muting Strike, Paralyze Arm, Paralyze Leg, Pierce Internal Organs, Pin Opponent, Punch, Pushbacks, Precision Shot, Rallying Maneuvers, Scare/Intimidate, Stand Your Ground, Trips & Throws"},
        {"weapon": "Dart", "deeds": "Bleeding Strike, Blinding Attack, Defensive Maneuvers, Disable Creature’s Wing, Disarming Attacks, Muting Strike, Paralyze Arm, Paralyze Leg, Pierce Internal Organs, Pin Opponent, Precision Shot, Rallying Maneuvers, Scare/Intimidate, Trips & Throws"},
        {"weapon": "Flail", "deeds": "Blinding Attack, Cripple Arm, Cripple Leg, Death From Above, Defensive Fighting, Defensive Maneuvers, Disable Creature’s Wing, Disarming Attacks, Headbutt, Howling Fury/ Rage, Kick, Muting Strike, Punch, Pushbacks, Rallying Maneuvers, Scare/Intimidate, Stand Your Ground, Throw Weapon, Trips & Throws"},
        {"weapon": "Handaxe", "deeds": "Bind & Strike, Bleeding Strike, Blinding Attack, Death From Above, Decapitating Strike , Defensive Fighting, Defensive Maneuvers, Disable Creature’s Wing, Disarming Attacks, Headbutt, Howling Fury/Rage, Kick, Muting Strike, Pin Opponent, Punch, Pushbacks, Precision Shot, Rallying Maneuvers, Scare/Intimidate, Sever Arm, Sever Leg, Stand Your Ground, Subdual Weapon Knockout, Trips & Throws"},
        {"weapon": "Lance", "deeds": "Bleeding Strike, Blinding Attack, Death From Above, Defensive Fighting, Defensive Maneuvers, Disable Creature’s Wing, Disarming Attacks, Howling Fury/Rage, Jousting Attack, Muting Strike, Paralyze Arm, Paralyze Leg, Pierce Internal Organs, Pin Opponent, Pushbacks, Rallying Maneuvers, Rend Armor, Scare/Intimidate, Sever Arm, Sever Leg, Shield Bash, Trips & Throws"},
        {"weapon": "Bow", "deeds": "Bleeding Strike, Blinding Attack, Defensive Maneuvers, Disable Creature’s Wing, Disarming Attacks, Muting Strike, Paralyze Arm, Paralyze Leg, Pierce Internal Organs, Pin Opponent, Precision Shot, Rallying Maneuvers, Scare/Intimidate, Stand Your Ground, Trips & Throws"},
        {"weapon": "Sword", "deeds": "Bind & Strike, Bleeding Strike, Blinding Attack, Death From Above, Decapitating Strike, Defensive Fighting, Defensive Maneuvers, Disable Creature’s Wing, Disarming Attacks, Headbutt, Howling Fury/Rage, Kick, Muting Strike, Paralyze Arm, Paralyze Leg, Pierce Internal Organs, Punch, Pushbacks, Rallying Maneuvers, Scare/Intimidate, Sever Arm, Sever Leg, Stand Your Ground, Subdual Weapon Knockout, Throw Weapon, Trips & Throws"},
        {"weapon": "Mace", "deeds": "Bind & Strike, Blinding Attack, Cripple Arm, Cripple Leg, Death From Above, Defensive Fighting, Defensive Maneuvers, Disable Creature’s Wing, Disarming Attacks, Headbutt, Howling Fury/Rage, Kick, Muting Strike, Punch, Pushbacks, Rallying Maneuvers, Scare/Intimidate, Stand Your Ground, Subdual Weapon Knockout, Throw Weapon, Trips & Throws"},
        {"weapon": "Polearm", "deeds": "Bleeding Strike, Blinding Attack, Decapitating Strike, Defensive Fighting, Defensive Maneuvers, Disable Creature’s Wing, Disarming Attacks, Headbutt, Howling Fury/Rage, Kick, Muting Strike, Paralyze Arm, Paralyze Leg, Pierce Internal Organs, Punch, Pushbacks, Rallying Maneuvers, Rend Armor, Scare/Intimidate, Sever Arm, Sever Leg, Stand Your Ground, Throw Weapon, Trips & Throws, Whirlwind Attack"},
        {"weapon": "Shield", "deeds": "Blinding Attack, Defensive Fighting, Defensive Maneuvers, Disarming Attacks, Headbutt, Howling Fury/Rage, Kick, Muting Strike, Pushbacks, Rallying Maneuvers, Scare/Intimidate, Shield Bash, Subdual Weapon Knockout, Throw Shield, Trips & Throws"},
        {"weapon": "Sling", "deeds": "Blinding Attack, Cripple Arm, Cripple Leg, Defensive Maneuvers, Disable Creature’s Wing, Disarming Attacks, Muting Strike, Precision Shot, Rallying Maneuvers, Scare/Intimidate, Stand Your Ground, Subdual Weapon Knockout, Trips & Throws"},
        {"weapon": "Spear", "deeds": "Bleeding Strike, Blinding Attack, Death From Above, Defensive Fighting, Defensive Maneuvers, Disable Creature’s Wing, Disarming Attacks, Headbutt, Howling Fury/Rage, Jousting Attack, Kick, Muting Strike, Paralyze Arm, Paralyze Leg, Pierce Internal Organs, Pin Opponent, Pushbacks, Precision Shot, Rallying Maneuvers, Scare/Intimidate, Stand Your Ground, Trips & Throws, Whirlwind Attack"},
        {"weapon": "Staff", "deeds": "Blinding Attack, Bone Crusher, Cripple Arm, Cripple Leg, Defensive Fighting, Defensive Maneuvers, Disable Creature’s Wing, Disarming Attacks, Flurry of Blows, Headbutt, Howling Fury/Rage, Kick, Muting Strike, Pulverize Internal Organs, Pushbacks, Rallying Maneuvers, Rend Armor, Scare/Intimidate, Stand Your Ground, Subdual Weapon Knockout, Throw Weapon, Trips & Throws, Whirlwind Attack"},
        {"weapon": "Two-Handed Sword", "deeds": "Bleeding Strike, Blinding Attack, Death From Above, Decapitating Strike, Defensive Fighting, Defensive Maneuvers, Disable Creature’s Wing, Disarming Attacks, Headbutt, Howling Fury/Rage, Kick, Muting Strike, Paralyze Arm, Paralyze Leg, Pierce Internal Organs, Pushbacks, Rallying Maneuvers, Rend Armor, Scare/Intimidate, Sever Arm, Sever Leg, Stand Your Ground, Subdual Weapon Knockout, Throw Weapon, Trips & Throws, Whirlwind Attack"},
        {"weapon": "War Hammer", "deeds": "Blinding Attack, Bone Crusher, Cripple Arm, Cripple Leg, Death From Above, Defensive Fighting, Defensive Maneuvers, Disable Creature’s Wing, Disarming Attacks, Headbutt, Howling Fury/Rage, Kick, Muting Strike, Pulverize Internal Organs, Pushbacks, Rallying Maneuvers, Rend Armor, Scare/Intimidate, Stand Your Ground, Subdual Weapon Knockout, Throw Weapon, Trips & Throws, Whirlwind Attack"}
        ],   
        "Tables":[
            {"name":"Blinding Attack", "description":"Blinding attacks usually involve making a called shot to an enemy’s eyes. Examples include throwing sand in an enemy’s face, stabbing a knife through a visor, or impaling a target’s eyeball with an arrow. Blinding attacks obviously must take place where appropriate to the enemy; they are useless against oozes, for example. Against certain opponents, such as a cyclops, the judge may 'bump up' results to the next-higher level, given the more serious effect of blinding blows against such creatures.",
                "rolls": {"Mighty Fumble" : "You stumble in your attempt and go crashing to the ground. During the fall you somehow manage to strike yourself. Take normal damage plus roll a crit on yourself using your crit die and table. You are considered prone and must use an action to stand. Melee attacks against a prone character receive a +2 bonus.",
                    "3" : "Opponent’s eyes are irritated and stinging, and he has difficulty seeing. On his next attack, the opponent suffers a -2 attack penalty.",
                    "4" :"Opponent is temporarily blinded. He suffers a -4 penalty to his next attack roll and may only move at half speed.",
                    "5" :"Opponent is completely blinded for 1d4 rounds. He flails about with wild attacks, suffering a -8 penalty to attack rolls, and can move only in a random direction at half speed.",
                    "6" :"Opponent is completely blinded, as above, for 2d6 rounds.",
                    "7" : "Opponent is blinded for the next 24 hours. Additionally, he must make a Fort save against the warrior’s attack roll. On a failure, he is permanently blinded.",
                    "Mighty Critical" : "You completely destroy your opponent’s eyes with a grisly attack. Foe is permanently blinded and falls to the ground paralyzed with shock."}},
            {"name": "Defensive Maneuvers", "description": "In certain circumstances, a warrior’s greatest Deed may be allowing his comrades to live to fight another day. Shield walls, fighting withdrawals, and back-to-back combat maneuvers can sometimes allow the warrior to support his entire party.", 
                "rolls":{"Mighty Fumble": "You stumble and fall, tripping over one of your allies as you try to form-up in a defensive position. The next attack on you is an automatic crit and all of your allies involved in the formation suffer a -3 to AC next round. You are considered prone and must use an action to stand. Melee attacks against a prone character receive a +2 bonus.", 
                    "3": "The warrior fights defensively, improving his chances of surviving. He receives a +1 AC bonus for the next round.", 
                    "4": "The warrior organizes a defensive formation among his allies, such as a shield wall, that is wellsuited to the opponent he fights. In addition to causing damage, he positions himself to “anchor” the defensive maneuver, granting a +1 AC bonus to himself and two allies who must be adjacent for the next round.", 
                    "5": "In addition to causing damage, the warrior forms up his allies to best defend themselves. As long as none of the allies move, the warrior and the allies receive a +1 AC bonus for the next round. Up to four allies can benefit.", 
                    "6": "In addition to causing damage, the warrior forms up his allies to best defend themselves. The warrior and the allies receive a +2 AC bonus, as long as no one moves. Up to four allies can benefit. If the warrior chooses to move and he scores an attack die roll of 6 or better, he can maintain a +1 AC bonus for himself and his four allies, provided they move in the same direction at the same speed and maintain their formation.", 
                    "7": "In addition to causing damage, the warrior forms up his allies to best defend themselves. The warrior and the allies receive a +3 AC bonus, as long as no one moves. Up to four allies can benefit. If the warrior chooses to move and he scores an attack die roll of 6 or better, he can maintain a +2 AC bonus for himself and his four allies, provided they move in the same direction at the same speed and maintain their formation.", 
                    "Mighty Critical": "Your defensive formation is impregnable. You and an unlimited amount of allies can be formed up in the defensive position which grants a +6 AC bonus if not moving and a +4 AC if moving. Your formation is worthy of the Battle of Thermopylae."}},    
            {"name": "Disarming Attacks", "description": "Disarming attacks include called shots to the hand, shattering an opponent’s weapon, severing a spear shaft, entangling a sword arm, and using the flat of a blade to smack a weapon from an enemy’s hand. Obviously, the opponent must have a weapon for this Deed to succeed; disarming an unarmed opponent would serve no purpose. Creatures with natural weapons – claws, fangs, horns, etc. – cannot be “disarmed” in the traditional sense but can have the use of their weapons limited.", 
                "rolls":{"Mighty Fumble": "The momentum of your strike carries you forward and you go crashing to the ground in a massive heap. During the fall you somehow manage to strike yourself. Take normal damage plus roll a crit on yourself using your crit die and table. You are considered prone and must use an action to stand. Melee attacks against a prone character receive a +2 bonus.", 
                    "3": "A humanoid creature with a weapon drops its weapon. There is a 50% chance the weapon is knocked out of reach. If the weapon is out of reach, the creature must move to retrieve it and cannot simultaneously attack on its next round (unless it chooses to fight unarmed or draw a new weapon). If the weapon is within reach, the creature can use its next action to recover the weapon and still attack. (Alternate results: stabbed hand throbs in pain, imposing a -1 attack penalty to future rolls; entangled sword arm is tied up, and as long as warrior devotes future combat rounds to maintain the entanglement, the enemy cannot attack.)", 
                    "4": "A humanoid creature with a weapon drops its weapon, which automatically lands out of reach (as above). There is a 50% chance a mundane weapon is sundered in the process. A sundered weapon is shattered or broken and cannot be used (except as an improvised weapon). Magic weapons are never sundered. (Alternate results: stabbed hand is crippled, imposing a -4 attack penalty to future rolls.)", 
                    "5": "A humanoid creature with a mundane weapon has it automatically sundered; a magical weapon is disarmed and lands out of reach. A monster with a natural attack method, such as claws or a bite, has its claws or teeth shattered, imposing a -4 penalty to damage rolls with the affected natural attack for the rest of the combat. Very large monsters, such as dragons, may not be affected or may receive a lesser penalty to damage rolls. (Alternate results: targeted hand is completely severed, requiring attacker to use off-hand for the balance of combat; sword arm is so thoroughly entangled that the warrior can release his weapon and make attacks with a new one while the target struggles to free itself in 1d4 rounds.)", 
                    "6": "Both humanoids and monsters have a weapon completely compromised. Manufactured weapons are either sundered or disarmed and land out of reach, while natural weapons are shattered. The attacking arm (or mouth or tentacle or whatever) is wounded and future attacks take at least a -4 penalty to damage rolls.", 
                    "7": "Both humanoids and monsters have a weapon completely compromised. Manufactured weapons are either sundered or disarmed and land out of reach, while natural weapons are shattered. The attacking arm (or mouth or tentacle or whatever) is considered useless and cannot be used to attack until healed.", 
                    "Mighty Critical": "You land a devastating strike to your opponent’s spine. Foe falls to the ground completely paralyzed...oh yeah and disarmed too."}},
            {"name": "Pushbacks", "description": "Pushbacks include shield bashes, tackles, bull rushes, tables hurled into enemies, doors smashed into opponents on the other side, and so on. Generally speaking, any attempt to use brute strength to forcefully move an opponent is considered a pushback.", 
                "rolls":{"Mighty Fumble": "You stumble and fall hitting the ground hard! Take 1d6 damage from the fall. If the damage die comes up a 6, you break a bone and permanently lose 1 point of Strength or Agility (player’s choice). The affected limb, rib, or vertebrae never heals quite right and affects the character in some fashion from then on. In addition to the damage, if you are wielding a weapon you also manage to strike yourself. Take normal damage plus roll a crit on yourself using your crit die and table. In either case you are considered prone and must use an action to stand. Melee attacks against a prone opponent receive a +2 bonus.", 
                    "3": "A creature the same size as the warrior is pushed back a few feet – enough space to open access to a door or staircase the target was defending.", 
                    "4": "A creature the same size as the warrior is pushed back a distance equal to half the warrior’s movement. A humanoid creature up to 50% larger than the warrior, such as a large orc or a small ogre, is pushed back a few feet. A stable, quadrupedal creature such as a horse or cow can also be pushed back a few feet.", 
                    "5": "The warrior can shove back a creature up to twice his size, such as a fully-grown ogre or a small giant, a distance equal to his full movement. Furthermore, he can pick up and hurl such a creature up to half his normal movement. This can allow the warrior to shove creatures off a nearby cliff, through a railing, out a chapel’s stained-glass window, and so on.", 
                    "6": "The warrior can push back several oncoming opponents, such as a charging mass of goblins or a wall of marching men-at-arms. He can shove back a creature up to three times his size and can even budge creatures like small dragons and large basilisks.", 
                    "7": "The warrior can push back several oncoming opponents, such as a charging mass of goblins or a wall of marching men-at-arms. In addition, he can shove back creatures that would be seemingly impossible for someone his size to push back (e.g. dragons, basilisks, etc).", 
                    "Mighty Critical":"The warrior can push back several oncoming opponents, such as a charging mass of goblins or a wall of marching men-at-arms. In addition, he can shove back creatures that would be seemingly impossible for someone his size to push back (e.g. dragons, basilisks, etc). The creatures are considered stunned for 1 round per warrior level. Stunned creatures suffer a -2 penalty to attack rolls. Melee attacks against a stunned creature receive a +2 bonus."}},
            {"name": "Precision Shot", "description": "A precision shot is one that boggles the mind with its accuracy. These feats of precision include severing the hangman’s noose with a well-placed arrow from twenty paces, lodging a sword in the dragon’s mouth so it cannot use a breath weapon, and smashing the evil cleric’s anti-holy symbol so he loses control over his un-dead minions. When declaring a precision shot, the warrior must declare exactly which target he is attempting to affect. For example, 'I hurl my spear and try to shatter the hinge on the enemy’s helmet visor' or 'I swing my sword and try to sever the knight’s stirrup.' This category also includes called shots that attempt to do additional damage. For example, aiming for an opponent’s head, trying to sever a monster’s neck, a belly shot against a lumbering chaos beast, and so on. Called shots may do additional damage based on the roll, as noted below.",
                "rolls":{"Mighty Fumble": "If wielding a crossbow or bow your string snaps striking you in the face. If you are wielding a thrown missile weapon you stumble and fall in mid throw. Either way take normal damage plus roll a crit on yourself using your crit die and table. You are considered prone and must use an action to stand. Melee attacks against a prone opponent receive a +2 bonus.", 
                    "3": "The warrior can hit a small object that is nearby – either at melee range or very close range via missile fire. For example, he can hit a holy symbol displayed by a cleric, a banner flown by a cavalier nearby, or an ogre’s tusk. A called shot here may do up to 1d4 points of additional damage (judge’s discretion).", 
                    "4": "The warrior can hit a target that is normally within the province of only the most skilled swordsmen or archers. For example, he can shoot an apple off someone’s head or hit the bull’s-eye at 100 yards. A called shot here may do up to 1d5 points of additional damage (judge’s discretion).", 
                    "5": "The warrior can make a near-impossible shot that includes slicing a narrow rope with an arrow from 100 yards away, hurling a dagger into a coin from across a moat, or stabbing a sword through the one vulnerable scale on the vast scaly hide of an ancient dragon. A called shot here may do up to 1d6 points of additional damage (judge’s discretion).", 
                    "6": "The warrior can make precise shots, such as the ones above, while also blinded and deafened – he relies on his other senses to attempt such an incredible maneuver. A called shot here may do up to 1d7 points of additional damage (judge’s discretion).", 
                    "7": "The warrior can make precise shots that seem beyond the abilities of mortal man – provided he can contrive an explanation. For example, he can shoot an arrow through a doorway to hit the evil wizard in the throat in the room beyond, explaining that the arrow actually went through the narrowest crack between the door and its frame. He can hurl a stone more than half a mile to knock out the goblin kidnapper as he gallops away on horseback, explaining that a passing hawk carried the stone in its beak for several hundred yards, then let it continue on its original trajectory. A called shot here may do up to 1d8 points of additional damage (judge’s discretion).", 
                    "Mighty Critical":"You strike your opponent through the eye, liquefying brain. Grey matter slowly begins to leak from ears and nose as foe stumbles away to find a comfortable place to die."}},
            {"name": "Rallying Maneuvers", "description": "The mighty hero, bounding to the front of combat, can restore order to broken ranks. A bellowing war cry, a heroic charge, a frothing bloodthirsty maniac exemplifying bloody prowess: the right rallying maneuver by a great warrior can make an army fight better than it ever has before.", 
                "rolls":{"Mighty Fumble": "Your attempt to boost morale is an epic failure as you trip and fall striking yourself on the way to the ground. Take normal damage plus roll a crit on yourself using your crit die and table. In addition you are prone and must use an action to stand. Melee attacks against a prone character receive a +2 bonus. All followers in line of sight of your blunder must make a morale check at a -6 penalty.", 
                    "3": "The warrior can let loose a war cry or perform some flashy maneuver that rallies his troops around him. Nearby hirelings and retainers that have failed a morale check get a second check and recover their wits if they succeed.", 
                    "4": "The warrior urges his allies to form up around him and leads the charge! He must be at the forefront of the battle, succeeding in his attacks and setting an example for his followers, who receive a +1 bonus to morale checks for the remainder of the round.", 
                    "5": "The warrior performs some dramatic combat maneuver that inspires courage. Allies and followers receive a +1 bonus to morale checks for the rest of the round. Additionally, if the warrior kills his opponent this round or causes a critical hit (or some other spectacular blow), all allies and followers receive a +1 attack bonus for the next round.", 
                    "6": "The warrior’s incredible maneuver affects not only nearby allies and followers but extends to as many as 100 followers, as long as they can see the hero. Allies and followers receive a +1 bonus to morale checks for the rest of the round. Additionally, if the warrior kills his opponent this round or causes a critical hit (or some other spectacular blow), all allies and followers receive a +1 attack bonus for the next round.", 
                    "7": "The warrior’s incredible maneuver affects not only nearby allies and followers but extends to potentially an entire army of thousands of men, as long as they can see the hero! Allies and followers receive a +1 bonus to morale checks for the rest of the round. Additionally, if the warrior kills his opponent this round or causes a critical hit (or some other spectacular blow), all allies and followers receive a +1 attack bonus for the next round.", 
                    "Mighty Critical": "The warrior’s incredible maneuver affects not only nearby allies and followers but extends to potentially an entire army of thousands of men, as long as they can see the hero! Allies and followers receive a +6 bonus to morale checks and a +6 attack bonus for remainder of fight, so long as the warrior is fighting as well. Additionally, if the warrior kills his opponent this round or causes a critical hit (or some other spectacular blow), all allies and followers receive a +1 attack bonus for the next round."}},
            {"name": "Shield Bash", "description": "You slam your shield into your opponent with thunderous force. In addition to the normal shield bash damage your attack may knockdown, disarm or knockout your foe.", 
                "rolls":{"Mighty Fumble": "You misstep as you strike landing your blow at an awkward angle destroying both your shield and your arm before you go spinning to the ground. Your shield arm is broken and useless until healed. During the fall you somehow manage to strike yourself. Take normal damage plus roll a crit on yourself using your crit die and table. You are considered prone and must use an action to stand. Attacks against a prone character receive a +2 bonus. Magical shields are not sundered but land 1d10+5 feet away and require an action to retrieve it.", 
                    "3": "Your shield slams into opponent’s torso and bruises rib cage. In addition to the normal shield bash damage, opponent stumbles desperately trying to catch his breath. On next attack, opponent suffers a -2 attack penalty.", 
                    "4": "Your shield sweeps into your opponent catching them off-guard. Humanoid creature with a weapon must make a Ref save against warrior’s attack roll or drop weapon. An action must be used to pick up dropped weapon. In addition to the normal shield bash damage, opponent suffers a -2 attack penalty on next attack from lack of balance.", 
                    "5": "You bring your shield down hard crushing your opponent’s knee. In addition to the normal shield bash damage, opponent suffers a -2 on all future attack rolls until healed. Opponent is also knocked prone and must spend next attack action to stand. Melee attacks against a prone opponent receive a +2 bonus.", 
                    "6": "You smash your shield into your opponent’s face. In addition to the normal shield bash damage, foe loses 1d6 teeth and must make a Ref save against warrior’s attack roll. Failed Save: Opponent is stunned for 1d3+1 rounds. Stunned creatures suffer a -2 penalty to attack rolls. Melee attacks against a stunned creature receive a +2 bonus. Successful Save: Opponent is considered prone and must spend next attack action to stand. Melee attacks against a prone opponent receive a +2 bonus.", 
                    "7": "You drive the top of your shield directly under your opponent’s chin shattering foe’s jaw. In addition to the normal shield bash damage, opponent is stunned for 2d4 rounds. Stunned creatures suffer a -2 penalty to attack rolls. Melee attacks against a stunned creature receive a +2 bonus.", 
                    "Mighty Critical": "You shield bash opponent in the midsection causing foe to buckle over, then you follow through with a viscous strike as you slam the edge of your shield down on the back of your foe’s neck. Your opponent collapses to the ground in wide eyed horror, paralyzed from the shoulders down."}},                
            {"name": "Throw Shield", "description": "As an act of desperation or an attempt to surprise your foe, you hurl your shield at your opponent. The attack may result in the shield being sundered.", 
                "rolls":{"Mighty Fumble": "Bad idea! You lose control of your shield, striking yourself and sending it straight backwards 15 feet. Take normal damage plus roll a crit on yourself using your crit die and table. In addition, roll an attack against the first being (friend or foe) within 15 feet of your backside. Your shield is sundered. A sundered shield is shattered or broken and cannot be used. Magical shields are not sundered but land 1d10+5 feet away and require an action to retrieve it.", 
                    "3": "You throw your shield striking your opponent with a glancing blow. Opponent takes normal shield bash damage and suffers a -2 attack penalty on next attack. In order to retrieve your shield you must spend an action to do so. There is a 30% chance your shield is sundered. A sundered shield is shattered or broken and cannot be used. Magic shields are not sundered.", 
                    "4": "You toss your shield striking your opponent with a solid blow. Opponent takes normal shield bash damage and suffers a -4 attack penalty on next attack. In order to retrieve your shield you must spend an action to do so. There is a 25% chance your shield is sundered. A sundered shield is shattered or broken and cannot be used. Magic shields are not sundered.", 
                    "5": "You hurl your shield catching your opponent by surprise. Opponent takes normal shield bash damage and must make a Ref save against warrior’s attack roll. Failed Save: Opponent is knocked prone and must spend next attack action to stand. Melee attacks against a prone opponent receive a +2 bonus. Successful Save: Opponent suffers a -6 attack penalty on next attack. In order to retrieve your shield you must spend an action to do so. There is a 20% chance your shield is sundered. A sundered shield is shattered or broken and cannot be used. Magic shields are not sundered.", 
                    "6": "You heave your shield smashing your opponent in the head. Opponent takes 2x shield bash damage and must make a Ref save against warrior’s attack roll. Failed Save: Opponent is stunned for 1d3 rounds. Stunned creatures suffer a -2 penalty to attack rolls. Melee attacks against a stunned creature receive a +2 bonus. Successful Save: Opponent is considered prone and must spend an action to stand. Melee attacks against a prone opponent receive a +2 bonus. In order to retrieve your shield you must spend an action to do so. There is a 15% chance your weapon is sundered. A sundered shield is shattered or broken and cannot be used. Magic shields are not sundered.", 
                    "7": "You launch your shield striking your opponent in the face with a resounding blow! Opponent takes 2x damage and is stunned for 2d3 rounds. Stunned creatures suffer a -2 penalty to attack rolls. Melee attacks against a stunned creature receive a +2 bonus. In order to retrieve your shield you must spend an action to do so. There is a 10% chance your shield is sundered. A sundered shield is shattered or broken and cannot be used. Magic shields are not sundered.", 
                    "Mighty Critical": "Your shield streaks through the air like a discus catching your opponent across the neck. Foe collapses to the ground with a severed jugular, dying in a spreading pool of blood."}},
            {"name": "Throw Weapon", "description": "As an act of desperation or an attempt to surprise your foe you throw a non-ranged melee weapon (i.e. sword, mace, battleaxe) at your opponent. The attack may cause massive injury but may also result in the weapon being sundered.", 
                "rolls":{"Mighty Fumble": "Bad idea! You lose control of your weapon, striking yourself and sending it straight backwards 15 feet. Take normal damage plus roll a crit on yourself using your crit die and table. In addition, roll an attack against the first being (friend or foe) within 15 feet of your backside. Your weapon is shattered or broken and cannot be used (except as an improvised weapon). Magic weapons are not sundered but land 1d10+5 feet away and require an action to retrieve it.", 
                    "3": "You throw your weapon striking your opponent with a glancing blow. Opponent takes normal weapon damage and suffers a -2 attack penalty on next attack. In order to retrieve your weapon you must spend an action to do so. There is a 30% chance your weapon is sundered. A sundered weapon is shattered or broken and cannot be used (except as an improvised weapon). Magic weapons are not sundered.", 
                    "4": "You toss your weapon striking your opponent with a solid blow. Opponent takes normal weapon damage and suffers a -4 attack penalty on next attack. In order to retrieve your weapon you must spend an action to do so. There is a 25% chance your weapon is sundered. A sundered weapon is shattered or broken and cannot be used (except as an improvised weapon). Magic weapons are not sundered.", 
                    "5": "You hurl your weapon catching your opponent by surprise. Opponent takes normal weapon damage and is knocked prone. Melee attacks against a prone opponent receive a +2 bonus. In order to retrieve your weapon you must spend an action to do so. There is a 20% chance your weapon is sundered. A sundered weapon is shattered or broken and cannot be used (except as an improvised weapon). Magic weapons are not sundered.", 
                    "6": "You heave your weapon smashing your opponent in the chest. Opponent takes 2x weapon damage and must make a Ref save against warrior’s attack roll. Failed Save: Opponent is stunned for 1d3 rounds. Stunned opponent’s suffer a -2 penalty to attack rolls. Melee attacks against a stunned opponent receive a +2 bonus. Successful Save: Opponent is considered prone and must spend next attack action to stand. Melee attacks against a prone opponent receive a +2 bonus. In order to retrieve your weapon you must spend an action to do so. There is a 15% chance your weapon is sundered. A sundered weapon is shattered or broken and cannot be used (except as an improvised weapon). Magic weapons are not sundered.", 
                    "7": "You launch your weapon striking your opponent with a solid blow! (Bludge. Weapon) Weapon strikes foe in the face knocking out 1d10 teeth. (Pierce. Weapon) Weapon is embedded in foe’s chest. (Slash. Weapon) Weapon slashes foe’s throat. Opponent takes 2x weapon damage and is stunned for 2d3 rounds. Stunned creatures suffer a -2 penalty to attack rolls. Melee attacks against a stunned creature receive a +2 bonus. In order to retrieve your weapon you must spend an action to do so. There is a 10% chance your weapon is sundered. A sundered weapon is shattered or broken and cannot be used (except as an improvised weapon). Magic weapons are not sundered.", 
                    "Mighty Critical": "You catapult your weapon with deadly force and accuracy. (Bludge. Weapon) Weapon strikes opponent in the head caving in foe’s skull. (Pierce. Weapon) Weapon is embedded in opponent’s chest piercing foe’s heart. (Slash. Weapon) Weapon decapitates foe and sends head sailing 1d10+5 feet through the air. Opponent is dead. In order to retrieve your weapon you must spend an action to do so."}},
            {"name": "Whirlwind Attack", "description": "When being surrounded by multiple foes you become a whirlwind of death striking one or more opponents with the same attack so long as they are within melee range. A warrior need not make another attack or damage roll regardless of the number of opponents indicated by the deed die. Simply use the original attack roll against all indicated opponents within range. If the original attack roll is sufficient to beat the new opponent’s AC, apply the original damage roll as well. Example: A warrior surrounded by enemies successfully hits his opponent with an attack roll of 15 and rolls a 6 on the Whirlwind Deed, dealing a total of 9pts of damage. Because the deed die was a 6, the warrior has also attacked all opponents in melee range within 360 degrees of the warrior. If the original attack roll of 15 is sufficient to beat any of the new opponents AC, they suffer 9pts of damage as well.", 
                "rolls":{"Mighty Fumble": "Whoops! You end up striking yourself before spinning to the ground. Take normal damage plus roll a crit on yourself using your crit die and table. In addition, you are prone and must use an action to stand. Melee attacks against a prone character receive a +2 bonus.", 
                    "3": "The force of your blow carries through and you are able to strike a second opponent that is within range. Apply the original attack roll to a second opponent within melee range. If the original attack roll is sufficient to beat the new opponent’s AC, apply the original damage as well.", 
                    "4": "You can strike up to three opponents within range with your mighty swing. Apply the original attack roll to a maximum of three opponents within melee range. If the original attack roll is sufficient to beat any of the new opponent’s AC, apply the original damage as well.", 
                    "5": "You cut a swath of destruction before you, striking up to four opponents within range. Apply the original attack roll to a maximum of four opponents within melee range. If the original attack roll is sufficient to beat any of the new opponent’s AC, apply the original damage as well.", 
                    "6": "You and your weapon become a whirlwind of doom! All opponents in range within 360 degrees of the warrior are attacked. Apply the original attack roll to all opponent’s within 360 degrees of the warrior. If the original attack roll is sufficient to beat any of the new opponent’s AC, apply the original damage as well.", 
                    "7": "You and your weapon become a cyclone of death! All opponents in range within 360 degrees of the warrior are attacked. Apply the original attack roll to all opponents within 360 degrees of the warrior. If the original attack roll is sufficient to beat any of the new opponent’s AC, apply the original damage as well. In addition, all opponents hit must make a Ref check against warrior’s attack roll or fall prone. Prone opponents must use an action to stand. Melee attacks against a prone opponent receive a +2 bonus.", 
                    "Mighty Critical": "You are more deadly than a whirling ball of butcher knives! You strike dead your first opponent and successfully score a crit on all other opponents in range within 360 degrees, as they go toppling over like scattered sticks before a storm. Roll a crit using your crit die and table for all opponents in melee range within 360 degrees of the warrior. Bards will sing of this battle for years to come."}}
            ]
}